БухЭксп/Catalogs/CW_НастройкиКлючевыхПоказателей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>CW_НастройкиКлючевыхПоказателей</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Пользователи</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИмяМакета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИндексЭлемента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранилищеНастроек</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкиОформления</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкиУсловногоОформления</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяПоказателя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеИспользуется</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

БухЭксп/Catalogs/CW_НастройкиКлючевыхПоказателей/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьСписокДоступныхМакетов();
	
	Если Параметры.Ключ.Пустая() Тогда
		УсловиеСравнения = "Равно";
		
		Если Не Параметры.ЗначениеКопирования.Пустая() Тогда
			CW_КлючевыеПоказателиСервер.ЗаполнитьТаблицуОформления(ЭтаФорма, Параметры.ЗначениеКопирования);
			ЗаполнитьТаблицуУсловногоОформления(Параметры.ЗначениеКопирования);
			УстановитьАдресНастроекКомпоновщика(Параметры.ЗначениеКопирования);
		КонецЕсли;  
	КонецЕсли;   
	
	CW_КлючевыеПоказателиСервер.ПриСозданииНаСервере(ЭтаФорма,Отказ, СтандартнаяОбработка); 
	Если ТаблицаУсловногоОформления.Количество() = 0 Тогда
		НастройкиУсловногоОформления = CW_КлючевыеПоказателиСервер.ПолучитьПустуюТаблицуУсловногоОформления();	
		ТаблицаУсловногоОформления.Загрузить(НастройкиУсловногоОформления);
	КонецЕсли;  
	
	ИспользуетсяУсловноеОформлениеЗначенияПриИзмененииНаСервере();

	УстановитьВидимостьПоказателя();
	УстановитьДоступностьОтбора();
	
	КлючевойПараметр = 1000.00;
	CW_КлючевыеПоказателиСервер.УстановитьПримерОформленияНаСервере(Элементы.КлючевойПараметрПример, ТаблицаОформления.Выгрузить()); 
	Если ИспользуетсяУсловноеОформлениеЗначения Тогда
		CW_КлючевыеПоказателиСервер.УстановитьПримерОформленияНаСервере(Элементы.КлючевойПараметрПримерУсловноеОформление, ТаблицаУсловногоОформления.Выгрузить()); 
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)  

	CW_КлючевыеПоказателиСервер.ЗаполнитьТаблицуОформления(ЭтаФорма, ТекущийОбъект);
	
 	ЗаполнитьТаблицуУсловногоОформления(ТекущийОбъект);
	УстановитьАдресНастроекКомпоновщика(ТекущийОбъект);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьАдресНастроекКомпоновщика(ТекущийОбъект)
	
	НастройкиКомпановщика = ТекущийОбъект.ХранилищеНастроек.Получить();
	АдресНастроек = ПоместитьВоВременноеХранилище(НастройкиКомпановщика, Новый УникальныйИдентификатор);
	
	ИнициализироватьКомпоновщикНастроек();

КонецПроцедуры  

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)  

	ЭлементЗначениеПараметра = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ВыводитьАрхивные"));
	Если ЭлементЗначениеПараметра <> Неопределено Тогда
		КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ВыводитьАрхивные", УчитыватьАрхивные);                                                                               
	КонецЕсли;
	
	ТекущийОбъект.ХранилищеНастроек = Новый ХранилищеЗначения(КомпоновщикНастроек.ПолучитьНастройки());  
	
	CW_КлючевыеПоказателиСервер.ЗаписатьНастройкиОформления(ЭтаФорма, ТекущийОбъект);

	//НастройкиУсловногоОформления 
	Если ИспользуетсяУсловноеОформлениеЗначения Тогда
		Оформление = Новый Структура;
		
		НайденныеСтроки = ТаблицаУсловногоОформления.НайтиСтроки(Новый Структура("Выбор", Истина));
		Для Каждого СтрокаСтиля из НайденныеСтроки Цикл
			Оформление.Вставить(СтрокаСтиля.Параметр, СтрокаСтиля.Значение);
		КонецЦикла;
		
		НастройкиУсловногоОформления = Новый Структура;
		НастройкиУсловногоОформления.Вставить("Условие",	УсловиеСравнения);
		НастройкиУсловногоОформления.Вставить("Значение",	ЗначениеСравнения);
		НастройкиУсловногоОформления.Вставить("Оформление",	Оформление);
	КонецЕсли;
	
	ТекущийОбъект.НастройкиУсловногоОформления 	= Новый ХранилищеЗначения(НастройкиУсловногоОформления);
	//---НастройкиУсловногоОформления
	
КонецПроцедуры

&НаСервере
Процедура УстановитьСписокДоступныхМакетов()
	
	Элементы.ИмяМакета.СписокВыбора.Очистить();
	Элементы.ИмяМакета.СписокВыбора.Добавить("Грузоперевозки", "Грузоперевозки");
	
	Если ПолучитьФункциональнуюОпцию("CW_ИспользованиеЗаказов") Тогда
		Элементы.ИмяМакета.СписокВыбора.Добавить("Заказы", "Заказы");
	КонецЕсли;   
	
	Если ПолучитьФункциональнуюОпцию("CW_ИспользованиеЗаявок") Тогда
		Элементы.ИмяМакета.СписокВыбора.Добавить("Заявки", "Заявки");
	КонецЕсли;
	
	Если CW_ПраваДоступа.ПравоДоступно("ПросмотрФинансов_Доходы") Тогда
		Элементы.ИмяМакета.СписокВыбора.Добавить("ДебиторскаяЗадолженность", "Дебиторская задолженность");
	КонецЕсли;
	
КонецПроцедуры


&НаСервере
Процедура ЗаполнитьТаблицуУсловногоОформления(ТекущийОбъект, УстановитьУспользованиеОформления=Истина) 
	
	НастройкиУсловногоОформления = ТекущийОбъект.НастройкиУсловногоОформления.Получить(); 
	Если НастройкиУсловногоОформления = Неопределено Тогда
		Если УстановитьУспользованиеОформления Тогда
			ИспользуетсяУсловноеОформлениеЗначения = Ложь;
		КонецЕсли;
		Возврат;
	КонецЕсли;

	НоваяТаблицаОформления = CW_КлючевыеПоказателиСервер.ПолучитьПустуюТаблицуУсловногоОформления();	
	
	Если ТипЗнч(НастройкиУсловногоОформления) = Тип("Структура")
		и НастройкиУсловногоОформления.Свойство("Условие")
		и НастройкиУсловногоОформления.Свойство("Значение")
		и НастройкиУсловногоОформления.Свойство("Оформление") Тогда 
		
		УсловиеСравнения  = НастройкиУсловногоОформления.Условие;	
		ЗначениеСравнения = НастройкиУсловногоОформления.Значение;	
		
		Для каждого КлючЗначение из НастройкиУсловногоОформления.Оформление Цикл
			НайденаняСтрока = НоваяТаблицаОформления.Найти(КлючЗначение.Ключ, "Параметр");
			Если НайденаняСтрока <> Неопределено Тогда
				НайденаняСтрока.Значение = КлючЗначение.Значение;	
				НайденаняСтрока.Выбор 		= Истина;
			Конецесли;
		КонецЦикла;
	КонецЕсли;  
	
	Если УстановитьУспользованиеОформления Тогда
		ИспользуетсяУсловноеОформлениеЗначения = Истина;
	КонецЕсли;
	
	ТаблицаУсловногоОформления.Загрузить(НоваяТаблицаОформления);
	
КонецПроцедуры 

&НаКлиенте
Процедура ИмяМакетаПриИзменении(Элемент) 
	
	ИмяМакетаПриИзмененииНаСеврере();
	ИнициализироватьКомпоновщикНастроек();  
	
КонецПроцедуры

&НаСервере
Процедура ИмяМакетаПриИзмененииНаСеврере()  
	
	ПоместитьВоВременноеХранилище(Неопределено, АдресНастроек);  
	
	УстановитьВидимостьПоказателя();
	УстановитьДоступностьОтбора();

КонецПроцедуры 

&НаСервере
Процедура УстановитьДоступностьОтбора()
	
	Элементы.КомпоновщикНастроекНастройкиОтбор.Доступность = Не ПустаяСтрока(Объект.ИмяМакета);

КонецПроцедуры


&НаСервере
Процедура УстановитьВидимостьПоказателя()
	
	Элементы.ИмяПоказателя.Видимость 		= (Объект.ИмяМакета = "ДебиторскаяЗадолженность"); 
	
КонецПроцедуры

&НаСервере
Процедура ИнициализироватьКомпоновщикНастроек()    
	
	СоответствиеОбщегоМакетаПоИмени = CW_КлючевыеПоказателиСервер.ПолучитьСоответствиеИмениМакета();
	
	ИмяМакета = СоответствиеОбщегоМакетаПоИмени.Получить(Объект.ИмяМакета);
	
	Схема 		= ПолучитьОбщийМакет(ИмяМакета);
    АдресСхемы 	= ПоместитьВоВременноеХранилище(Схема, Новый УникальныйИдентификатор);

	Если ЭтоАдресВременногоХранилища(АдресНастроек) Тогда
		НастройкиКомпоновщика = ПолучитьИзВременногоХранилища(АдресНастроек);
	КонецЕсли;  
	
	Если НастройкиКомпоновщика = Неопределено Тогда
		НастройкиКомпоновщика = Схема.НастройкиПоУмолчанию;  
	КонецЕсли;
	
	КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресСхемы));	
	
	КомпоновщикНастроек.ЗагрузитьНастройки(НастройкиКомпоновщика);
	
	ЭлементЗначениеПараметра = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ВыводитьАрхивные"));
	Если ЭлементЗначениеПараметра <> Неопределено Тогда    
		УчитыватьАрхивные = ЭлементЗначениеПараметра.Значение;                                                                               
	КонецЕсли;   
	Элементы.УчитыватьАрхивные.Видимость = ЭлементЗначениеПараметра <> Неопределено; 
	
КонецПроцедуры


&НаКлиенте
Процедура ТаблицаОформленияПриИзменении(Элемент)
	ТаблицаОформленияПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ТаблицаОформленияПриИзмененииНаСервере() 
	
	CW_КлючевыеПоказателиСервер.УстановитьПримерОформленияНаСервере(Элементы.КлючевойПараметрПример, ТаблицаОформления.Выгрузить());

КонецПроцедуры

&НаКлиенте
Процедура ТаблицаОформленияЗначениеПриИзменении(Элемент) 
	
	ТекущаяСтрока = Элементы.ТаблицаОформления.ТекущаяСтрока;
	ТаблицаОформленияЗначениеПриИзмененииНаСервере(ТекущаяСтрока);  
	
КонецПроцедуры

&НаСервере
Процедура ТаблицаОформленияЗначениеПриИзмененииНаСервере(ТекущаяСтрока) 
	
	 CW_КлючевыеПоказателиСервер.ТаблицаОформленияПриИзмененииЗначения(ЭтаФорма, ТекущаяСтрока);
	
КонецПроцедуры   

&НаКлиенте
Процедура ТаблицаОформленияВыборПриИзменении(Элемент)  
	
	ТекущаяСтрока = Элементы.ТаблицаОформления.ТекущаяСтрока;
	ТаблицаОформленияВыборПриИзмененииНаСервере(ТекущаяСтрока); 
	
КонецПроцедуры

&НаСервере
Процедура ТаблицаОформленияВыборПриИзмененииНаСервере(ТекущаяСтрока)  
	
	 CW_КлючевыеПоказателиСервер.ТаблицаОформленияПриИзмененииФлага(ЭтаФорма, ТекущаяСтрока); 
	 
КонецПроцедуры


&НаКлиенте
Процедура ТаблицаОформленияЗначениеНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ТаблицаОформления.ТекущиеДанные;
	Если CW_КлючевыеПоказателиКлиент.НуженДиалогРедактированияОформления(ТекущиеДанные.Параметр) тогда
		СтандартнаяОбработка = Ложь;                                    
		
		ТекущаяСтрока = Элементы.ТаблицаОформления.ТекущаяСтрока;
		
		ДополнительныеПараметры = Новый Структура;                      
		ДополнительныеПараметры.Вставить("ТекущаяСтрока",ТекущаяСтрока); 
		
		Оповещение = Новый ОписаниеОповещения("ПослеВыбораЗначения",ЭтотОбъект, ДополнительныеПараметры);
		
		CW_КлючевыеПоказателиКлиент.ОткрытьДиалогРедактированияОформления(ТекущиеДанные.Параметр, ТекущиеДанные.Значение, Оповещение);
	КонецЕсли;

	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораЗначения(ВыбранноеЗначение, ДополнительныеПараметры) Экспорт 
	
	Если ВыбранноеЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОбработатьВыборЗначенияНаСервере(ВыбранноеЗначение, ДополнительныеПараметры.ТекущаяСтрока);
	
КонецПроцедуры 

&НаСервере
Процедура ОбработатьВыборЗначенияНаСервере(Значение, ТекущаяСтрока)  
	
	СтрокаТекущая = ТаблицаОформления.НайтиПоИдентификатору(ТекущаяСтрока);
	СтрокаТекущая.Значение = Значение;
	
	CW_КлючевыеПоказателиСервер.ТаблицаОформленияПриИзмененииЗначения(ЭтаФорма, ТекущаяСтрока);
	CW_КлючевыеПоказателиСервер.УстановитьПримерОформленияНаСервере(Элементы.КлючевойПараметрПример, ТаблицаОформления.Выгрузить());
	CW_КлючевыеПоказателиСервер.УстановитьПримерОформленияНаСервере(Элементы.КлючевойПараметрПримерУсловноеОформление, ТаблицаУсловногоОформления.Выгрузить()); 

КонецПроцедуры

&НаКлиенте
Процедура ТаблицаУсловногоОформленияВыборПриИзменении(Элемент) 
	
 	ТекущаяСтрока = Элементы.ТаблицаУсловногоОформления.ТекущаяСтрока;
	ТаблицаУсловногоОформленияВыборПриИзмененииНаСервере(ТекущаяСтрока); 
	
КонецПроцедуры    

&НаСервере
Процедура ТаблицаУсловногоОформленияВыборПриИзмененииНаСервере(ТекущаяСтрока)  
	
	СоответствиеТипаПараметра = CW_КлючевыеПоказателиСервер.ПолучитьСоответствиеТипаПараметра();
	
	СтрокаТекущая = ТаблицаУсловногоОформления.НайтиПоИдентификатору(ТекущаяСтрока);
	
	Если Не СтрокаТекущая.Выбор Тогда
		СтрокаТекущая.Значение = СоответствиеТипаПараметра.Получить(СтрокаТекущая.Параметр);	
	КонецЕсли;
	 
КонецПроцедуры



&НаКлиенте
Процедура ТаблицаУсловногоОформленияПриИзменении(Элемент)
	ТаблицаУсловногоОформленияПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ТаблицаУсловногоОформленияПриИзмененииНаСервере()    
	
	CW_КлючевыеПоказателиСервер.УстановитьПримерОформленияНаСервере(Элементы.КлючевойПараметрПримерУсловноеОформление, ТаблицаУсловногоОформления.Выгрузить()); 
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаУсловногоОформленияЗначениеПриИзменении(Элемент)

	ТекущаяСтрока = Элементы.ТаблицаУсловногоОформления.ТекущаяСтрока;
	ТаблицаУсловногоОформленияЗначениеПриИзмененииНаСервере(ТекущаяСтрока);  
	
КонецПроцедуры  

 &НаСервере
Процедура ТаблицаУсловногоОформленияЗначениеПриИзмененииНаСервере(ТекущаяСтрока)
	
	СоответствиеТипаПараметра = CW_КлючевыеПоказателиСервер.ПолучитьСоответствиеТипаПараметра();
	
	СтрокаТекущая = ТаблицаУсловногоОформления.НайтиПоИдентификатору(ТекущаяСтрока);
	СтрокаТекущая.Выбор = (СтрокаТекущая.Значение <> СоответствиеТипаПараметра.Получить(СтрокаТекущая.Параметр));
	
КонецПроцедуры   


&НаКлиенте
Процедура ТаблицаУсловногоОформленияЗначениеНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ТаблицаУсловногоОформления.ТекущиеДанные;
	Если ТекущиеДанные.Параметр = "Рамка" Тогда 
		Возврат;
	КонецЕсли;

	СтандартнаяОбработка = Ложь;                                    
	
	ТекущаяСтрока = Элементы.ТаблицаУсловногоОформления.ТекущаяСтрока;
	
	ДополнительныеПараметры = Новый Структура;                      
	ДополнительныеПараметры.Вставить("ТекущаяСтрока",ТекущаяСтрока); 
	
	Оповещение = Новый ОписаниеОповещения("ПослеВыбораЗначенияУсловногоФормления",ЭтотОбъект, ДополнительныеПараметры);
	
	Если ТекущиеДанные.Параметр = "Формат" Тогда
		КонструкторФорматнойСтроки = Новый КонструкторФорматнойСтроки;
		КонструкторФорматнойСтроки.Текст = ТекущиеДанные.Значение;
		КонструкторФорматнойСтроки.ДоступныеТипы = Новый ОписаниеТипов("Число");
		КонструкторФорматнойСтроки.Показать(Оповещение);   
	КонецЕсли;
	
	Если ТекущиеДанные.Параметр = "ЦветФона"
		или ТекущиеДанные.Параметр = "ЦветТекста" Тогда
		ДиалогВыбораЦвета = Новый ДиалогВыбораЦвета;
		ДиалогВыбораЦвета.Показать(Оповещение);
	КонецЕсли;
	
	Если ТекущиеДанные.Параметр = "Шрифт" Тогда
		ДиалогВыбораШрифта = Новый ДиалогВыбораШрифта;
		ДиалогВыбораШрифта.Показать(Оповещение);
	КонецЕсли;

КонецПроцедуры 

&НаКлиенте
Процедура ПослеВыбораЗначенияУсловногоФормления(ВыбранноеЗначение, ДополнительныеПараметры) Экспорт 
	
	Если ВыбранноеЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОбработатьВыборЗначенияУсловногоФормленияНаСервере(ВыбранноеЗначение, ДополнительныеПараметры.ТекущаяСтрока);
	
КонецПроцедуры 

&НаСервере
Процедура ОбработатьВыборЗначенияУсловногоФормленияНаСервере(Значение, ТекущаяСтрока)  
	
	СтрокаТекущая = ТаблицаУсловногоОформления.НайтиПоИдентификатору(ТекущаяСтрока);
	СтрокаТекущая.Значение = Значение;

	ТаблицаУсловногоОформленияЗначениеПриИзмененииНаСервере(ТекущаяСтрока);  
	CW_КлючевыеПоказателиСервер.УстановитьПримерОформленияНаСервере(Элементы.КлючевойПараметрПримерУсловноеОформление, ТаблицаУсловногоОформления.Выгрузить()); 
	
КонецПроцедуры
 

&НаКлиенте
Процедура ИспользуетсяУсловноеОформлениеЗначенияПриИзменении(Элемент)
	ИспользуетсяУсловноеОформлениеЗначенияПриИзмененииНаСервере();
КонецПроцедуры
 
&НаСервере
Процедура ИспользуетсяУсловноеОформлениеЗначенияПриИзмененииНаСервере()

	Элементы.ГруппаУсловноеОформление.Видимость = ИспользуетсяУсловноеОформлениеЗначения;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Оповестить("CW_НастройкиКлючевыхПоказателей_Запись");
	
КонецПроцедуры


&НаКлиенте
Процедура СкопироватьНастройкиОформления(Команда)  

	Оповещение = Новый ОписаниеОповещения("ПослеВыбораИсточникаНастроек", ЭтотОбъект);
	
	ОткрытьФормуВыбораНастроек(Оповещение);

КонецПроцедуры    

&НаКлиенте
Процедура СкопироватьНастройкиУсловногоОформления(Команда)

	Оповещение = Новый ОписаниеОповещения("ПослеВыбораИсточникаНастроекУсловногоОформления", ЭтотОбъект);
	
	ОткрытьФормуВыбораНастроек(Оповещение);

КонецПроцедуры 

&НаКлиенте
Процедура ОткрытьФормуВыбораНастроек(Знач Оповещение)
	
	Отбор = Новый Структура;
	Отбор.Вставить("Владелец", 	Объект.Владелец); 
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("Отбор", Отбор);   
	
	ОткрытьФорму("Справочник.CW_НастройкиКлючевыхПоказателей.ФормаВыбора", СтруктураПараметров, ЭтаФорма,,,,Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры  

&НаКлиенте
Процедура ПослеВыбораИсточникаНастроек(РезультатВыбора, ДополнительныеПараметры) Экспорт
	
	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	СкопироватьНастройкиОформленияНаСервере(РезультатВыбора);	
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораИсточникаНастроекУсловногоОформления(РезультатВыбора, ДополнительныеПараметры) Экспорт
	
	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	СкопироватьНастройкиУсловногоОформленияНаСервере(РезультатВыбора);	
	
КонецПроцедуры

&НаСервере
Процедура СкопироватьНастройкиОформленияНаСервере(ИсточникНастроек)
	
	CW_КлючевыеПоказателиСервер.ЗаполнитьТаблицуОформления(ЭтаФорма, ИсточникНастроек);
	CW_КлючевыеПоказателиСервер.УстановитьПримерОформленияНаСервере(Элементы.КлючевойПараметрПример, ТаблицаОформления.Выгрузить());
	
КонецПроцедуры

&НаСервере
Процедура СкопироватьНастройкиУсловногоОформленияНаСервере(ИсточникНастроек)
	
	НоваяТаблицаОформления = CW_КлючевыеПоказателиСервер.ПолучитьПустуюТаблицуУсловногоОформления();	
	ТаблицаУсловногоОформления.Загрузить(НоваяТаблицаОформления);
	
	ЗаполнитьТаблицуУсловногоОформления(ИсточникНастроек, Ложь);
	
	CW_КлючевыеПоказателиСервер.УстановитьПримерОформленияНаСервере(Элементы.КлючевойПараметрПримерУсловноеОформление, ТаблицаУсловногоОформления.Выгрузить()); 
	
КонецПроцедуры
